month_num = input('Введите номер месяца (1 - 12) ')
# Решение через list
# seasons = [('1', '2', '12', 'зима'), ('3', '4', '5', 'весна'), ('6', '7', '8', 'лето'), ('9', '10', '11', 'осень')]
# if month_num.isdigit():
#     for i in seasons:
#         if month_num in i:
#             print(i[3])
# else:
#     print('Нужно было ввести число от 1 - 12')

# Решение через dict
seasons = {
    '1': 'зима',
    '2': 'зима',
    '3': 'весна',
    '4': 'весна',
    '5': 'весна',
    '6': 'лето',
    '7': 'лето',
    '8': 'лето',
    '9': 'осень',
    '10': 'осень',
    '11': 'осень',
    '12': 'зима'
}
if month_num.isnumeric():
    for i in seasons.keys():
        if i == month_num:
            print(seasons[i])
else:
    print('Нужно было ввести число от 1 - 12')




